src/InformationRegisters/СхемаАдресацииЗадач/СхемаАдресацииЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СхемаАдресацииЗадач</name>
  <resources>
    <name>РольПользователя</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипИсполнителя</name>
    <type>
      <types>CatalogRef.ТипыИсполнителейКонтрольПамяти</types>
      <types>CatalogRef.ТипыИсполнителей</types>
      <types>CatalogRef.ТипыИсполнителейВнешнийКонтрольЦКК</types>
      <types>CatalogRef.ТипыИсполнителейАнализВызововКластера1С</types>
      <types>CatalogRef.ТипыИсполнителейОценкаПользователей</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПодключений</types>
      <types>CatalogRef.ТипыИсполнителейСборДампов</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольПроизводительности</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольРегламентныхЗаданий</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольЧислаИсключений</types>
      <types>CatalogRef.ТипыИсполнителейКонтрольНагрузочныхТестов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СхемаАдресацииЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограмнныйИнтерфейс

// Записать ответсвенного контроль потребления памяти
//
// Параметры:
//  КонтрольнаяПроцедура - СправочникСсылка.КонтрольныеПроцедуры - контрольная процедура для которой записывается ответсвенный.
//  РольПользователя     - СправочникСсылка.РолиПользователей    - роль пользователя для записи.
//
Процедура ЗаписатьОтветственного(КонтрольнаяПроцедура, РольПользователя) Экспорт
    
    Если КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольПотребленияПамяти() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейКонтрольПамяти.ОтветственныйЗаРазборПроблемПотребленияПамяти;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.АнализВызововКластера1С() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейАнализВызововКластера1С.ОтветственныйЗаАнализВызововКластера1С;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейСборДампов.ОтветственныйЗаРассмотрениеДампа;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольПодключений() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейКонтрольПодключений.ОтветственныйЗаВозможностьПодключения;
    ИначеЕсли КонтрольнаяПроцедура.Владелец = Справочники.ВидыКонтрольныхПроцедур.КонтрольПроизводительности() Тогда
        ТипИсполнителя = Справочники.ТипыИсполнителейКонтрольПроизводительности.ОтветственныйЗаРазборПроблемПроизводительности;
    КонецЕсли;
        
    МенеджерЗаписи = СоздатьМенеджерЗаписи();
    МенеджерЗаписи.ТипИсполнителя = ТипИсполнителя;
    МенеджерЗаписи.КонтрольнаяПроцедура = КонтрольнаяПроцедура;
    МенеджерЗаписи.РольПользователя = РольПользователя;
    
    МенеджерЗаписи.Записать(Истина);    
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
